DataProcessors/ТК_ЗагрузкаИзменений_ФС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ТК_ЗагрузкаИзменений_ФС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РезультатыВыполненияОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияОбработок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщенияОбОшибках</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТК_ЗагрузкаИзменений_ФС/Ext/ObjectModule.bsl
Функция МассивДокументовЗагрузки() Экспорт 
	
	МассивДок = Новый Массив;
	МассивДок.Добавить("УстановкаЦенНоменклатуры");
	МассивДок.Добавить("ОбщепитРецептура");
	МассивДок.Добавить("ОбщепитЗаказБанкета");
	МассивДок.Добавить("ПоступлениеТоваровУслуг");
	МассивДок.Добавить("ПеремещениеТоваров");
	МассивДок.Добавить("ОбщепитВыпускПродукции");
	МассивДок.Добавить("РеализацияТоваровУслуг");	
	МассивДок.Добавить("СписаниеТоваров");
	МассивДок.Добавить("ВозвратТоваровПоставщику");
	МассивДок.Добавить("ВозвратТоваровОтПокупателя");
	МассивДок.Добавить("ПриходныйКассовыйОрдер");
	МассивДок.Добавить("РасходныйКассовыйОрдер");
	МассивДок.Добавить("ПлатежноеПоручениеВходящее");
	МассивДок.Добавить("ПлатежноеПоручениеИсходящее");
	МассивДок.Добавить("ИнвентаризацияТоваровНаСкладе");
	МассивДок.Добавить("КорректировкаДолга");
	МассивДок.Добавить("НалоговаяНакладная");
	МассивДок.Добавить("ПоступлениеИзПереработки");
	МассивДок.Добавить("КомплектацияНоменклатуры");
	МассивДок.Добавить("ОприходованиеТоваров");
		
	Возврат МассивДок;	
	
КонецФункции

Процедура ЗагрузитьДанные(КлючОбработки,ОбъектыНаЗагрузку = Неопределено) Экспорт 
	
	ИдентификаторОбработки = "ЗагрузкаИзменений_ФС";		
	
	
	Попытка
		
		Пользователь = "ObmenSSL";
		Пароль = "bynthghbpf";	
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/OrdersChees/ws/cwd2.1cws?wsdl",Пользователь,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		WS.Пользователь = Пользователь;
		WS.Пароль = Пароль;
	
		//Правило = ПолучитьМакет("Правило").ПолучитьТекст();					
		//ХранилищеДанных = Новый ХранилищеЗначения(Правило, Новый СжатиеДанных(9));	
		
		ХранилищеДанных = ОбменДаннымиПереопределяемый.ПравилаКонвертацииОбъектов("ОбменФабрикаСыра", Истина);
		
	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		                                                                                       
		ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
		
		СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
		СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
		СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;
		
		КодСостояния = 	"ОбработкаОбмена.ИнициализацияОбработки - Ошибка инициализации";						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния "+КодСостояния, СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание "+ОшибкиИнициализации, СтруктруаЗаписиРезультатаВыполнения);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		
		Возврат;
		
	КонецПопытки;
	
	
	Если ОбъектыНаЗагрузку = Неопределено  Тогда
		ОбъектыНаЗагрузку = МассивДокументовЗагрузки();
	КонецЕсли;
	
	
	
	ВсеОК = Истина;	
	Description = "";
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;

	
	Для Каждого ОбЗагрузка Из ОбъектыНаЗагрузку Цикл 
		
		Загружено = 0;
		
		//УдалитьрегистрациюПередВыгрузкой = Ложь;
		ПараметрПродолжитьЗагрузку = Ложь;
		
		//ЗначенияПараметров = Новый Структура("КодУзла,УдалитьрегистрациюПередВыгрузкой, ТипОбмена, ДокументВыгрузки", "TKC", ПараметрПродолжитьЗагрузку, КлючОбработки, ОбЗагрузка);
		ЗначенияПараметров = Новый Структура("КодУзла, ТипОбмена, ДокументВыгрузки", "SSL", КлючОбработки, ОбЗагрузка);				
		ЗначенияПараметровXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначенияПараметров);
		
		резРег = WS.RegDoc("Полный");
		Если Не резРег Тогда
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
			Прервать;
		КонецЕсли;
			
		
		ДанныеЗагрузки = WS.ОтдатьДанные(ХранилищеДанных, ЗначенияПараметровXDTO, ПараметрПродолжитьЗагрузку,Истина);					
		Рез = ТК_ОбменДаннымиСервер.ВыполнитьЗагрузкуЧерезУниверсальныйОбменXML(ОбЗагрузка,ИдентификаторОбработки,ДанныеЗагрузки);		
		
		ВсеОК = Рез.Success;
		
		Если ВсеОК Тогда
			Если ВсеОК Тогда
				резДел = WS.DelRegDoc("Полный");
				Если Не резДел Тогда
					РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка удаление регистрации", СтруктруаЗаписиРезультатаВыполнения);	
					Прервать;
				КонецЕсли;
			Иначе
				резРег = WS.RegDoc("Полный");
				Если Не резРег Тогда
					РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
					Прервать;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Description = Description + Рез.Description +Символы.ПС;
		КонецЕсли;

		Загружено = Загружено + Рез.Загружено;
		
		ПродолжитьЗагрузку = (Рез.Success И ПараметрПродолжитьЗагрузку) И Рез.Загружено > 0;

				
		Пока ПродолжитьЗагрузку Цикл 
			
			СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
			СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
			СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;
			
			ЗначенияПараметров = Новый Структура("КодУзла,УдалитьрегистрациюПередВыгрузкой, ТипОбмена, ДокументВыгрузки", "TKC", ПродолжитьЗагрузку, КлючОбработки, ОбЗагрузка);
			ЗначенияПараметровXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначенияПараметров);

			
			
			
			ДанныеЗагрузки = WS.ОтдатьДанные(ХранилищеДанных, ЗначенияПараметровXDTO, ПродолжитьЗагрузку,Истина);					
			Рез = ТК_ОбменДаннымиСервер.ВыполнитьЗагрузкуЧерезУниверсальныйОбменXML(ОбЗагрузка,ИдентификаторОбработки,ДанныеЗагрузки);
			
			ВсеОК = Рез.Success;
			
			Если ВсеОК Тогда
				Если ВсеОК Тогда
					резДел = WS.DelRegDoc("Полный");
					Если Не резДел Тогда
						РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка удаление регистрации", СтруктруаЗаписиРезультатаВыполнения);	
						Прервать;
					КонецЕсли;
				Иначе
					резРег = WS.RegDoc("Полный");
					Если Не резРег Тогда
						РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Загружено = Загружено + Рез.Загружено;
			
			ПродолжитьЗагрузку = (Рез.Success И ПродолжитьЗагрузку) И Рез.Загружено > 0;
			
			Если ВсеОк = Ложь Тогда
				Description = Description + Рез.Description +Символы.ПС;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ВсеОК Тогда 
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание: "+Description, СтруктруаЗаписиРезультатаВыполнения);	
			Прервать;
		КонецЕсли;
		                                
										
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Объект ""%1"" загружено %2'"), 
				ОбЗагрузка,
				Загружено),
			СтруктруаЗаписиРезультатаВыполнения, 
			СтатусСообщения.Информация);	
		
	КонецЦикла;

	
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, ВсеОк);
		
	
КонецПроцедуры
